
    [
        {
            "title": "The Midnight Library",
            "author": "Matt Haig",
            "publishYear": 2020,
            "description": "Between life and death there is a library, and within that library, the shelves go on forever.When Nora Seed finds herself in the Midnight Library, she has a chance to make things right. Up until now, her life has been full of misery and regret. She feels she has let everyone down, including herself. But things are about to change.The books in the Midnight Library enable Nora to live as if she had done things differently. With the help of an old friend, she can now undo every one of her regrets as she tries to work out her perfect life. But things aren't always what she imagined they'd be, and soon her choices place the library and herself in extreme danger.",
            "category": ["Fiction", "Fantasy", "Contemporary"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1602190253i/52578297.jpg",
            "price": 158.99,
            "language": "English",
            "binding": "Hardcover",
            "tags": ["Best Seller", "Trending"],
            "discount": 10,
            "rating":4.5 , 
            "stock":300
        },
        {
            "title": "Educated",
            "author": "Tara Westover",
            "publishYear": 2018,
            "description": "A memoir by Tara Westover detailing her struggles growing up in a strict and abusive household in rural Idaho but eventually escaping to learn about the wider world through education.Tara Westover was 17 the first time she set foot in a classroom. Born to survivalists in the mountains of Idaho, she prepared for the end of the world by stockpiling home-canned peaches and sleeping with her 'head-for-the-hills bag'. In the summer she stewed herbs for her mother, a midwife and healer, and in the winter she salvaged in her father's junkyard.",
            "category": ["Biography", "Memoir", "Non-fiction"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1506026635i/35133922.jpg",
            "price": 180.00,
            "language": "English",
            "binding": "Paperback",
            "tags": ["Best Seller", "International Best Sellers"],
            "discount": 5,
            "rating":4.5,
            "stock":300
        },
        {
            "title": "Becoming",
            "author": "Michelle Obama",
            "publishYear": 2018,
            "description": "An intimate, powerful, and inspiring memoir by the former First Lady of the United States.In a life filled with meaning and accomplishment, Michelle Obama has emerged as one of the most iconic and compelling women of our era. As First Lady of the United States of America—the first African American to serve in that role—she helped create the most welcoming and inclusive White House in history, while also establishing herself as a powerful advocate for women and girls in the U.S. and around the world, dramatically changing the ways that families pursue healthier and more active lives, and standing with her husband as he led America through some of its most harrowing moments. Along the way, she showed us a few dance moves, crushed Carpool Karaoke, and raised two down-to-earth daughters under an unforgiving media glare.",
            "category": ["Biography", "Memoir", "Non-fiction"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1528206996i/38746485.jpg",
            "price": 200.00,
            "language": "English",
            "binding": "Hardcover",
            "tags": ["Best Seller", "International Best Sellers"],
            "discount": 15,
            "rating":4.5,
            "stock":350
        },
        {
            "title": "Where the Crawdads Sing",
            "author": "Delia Owens",
            "publishYear": 2018,
            "description": "A coming-of-age murder mystery set in the marshes of North Carolina.For years, rumors of the “Marsh Girl” haunted Barkley Cove, a quiet fishing village. Kya Clark is barefoot and wild; unfit for polite society. So in late 1969, when the popular Chase Andrews is found dead, locals immediately suspect her.But Kya is not what they say. A born naturalist with just one day of school, she takes life's lessons from the land, learning the real ways of the world from the dishonest signals of fireflies. But while she has the skills to live in solitude forever, the time comes when she yearns to be touched and loved. Drawn to two young men from town, who are each intrigued by her wild beauty, Kya opens herself to a new and startling world—until the unthinkable happens.",
            "category": ["Fiction", "Mystery", "Thriller"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1582135294i/36809135.jpg",
            "price": 149.99,
            "language": "English",
            "binding": "Paperback",
            "tags": ["Best Seller", "Trending"],
            "discount": 0,
            "rating":4.5,
            "stock":390
        },
        {
            "title": "Sapiens: A Brief History of Humankind",
            "author": "Yuval Noah Harari",
            "publishYear": 2014,
            "description": "A book that explores the history of humankind from the Stone Age to the present.From a renowned historian comes a groundbreaking narrative of humanity’s creation and evolution—a #1 international bestseller—that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be “human.” One hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one—homo sapiens. What happened to the others? And what may happen to us? Most books about the history of humanity pursue either a historical or a biological approach, but Dr. Yuval Noah Harari breaks the mold with this highly original book that begins about 70,000 years ago with the appearance of modern cognition. From examining the role evolving humans have played in the global ecosystem to charting the rise of empires, Sapiens integrates history and science to reconsider accepted narratives, connect past developments with contemporary concerns, and examine specific events within the context of larger ideas. Dr. Harari also compels us to look ahead, because over the last few decades humans have begun to bend laws of natural selection that have governed life for the past four billion years. We are acquiring the ability to design not only the world around us, but also ourselves. Where is this leading us, and what do we want to become? Featuring 27 photographs, 6 maps, and 25 illustrations/diagrams, this provocative and insightful work is sure to spark debate and is essential reading for aficionados of Jared Diamond, James Gleick, Matt Ridley, Robert Wright, and Sharon Moalem.",
            "category": ["Non-fiction", "History", "Science"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1703329310i/23692271.jpg",
            "price": 229.99,
            "language": "English",
            "binding": "Hardcover",
            "tags": ["Best Seller", "International Best Sellers"],
            "discount": 10,
            "rating":4.5,
            "stock":400
        },
        {
            "title": "Atomic Habits",
            "author": "James Clear",
            "publishYear": 2018,
            "description": "An easy & proven way to build good habits & break bad ones.No matter your goals, Atomic Habits offers a proven framework for improving—every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.",
            "category": ["Self-help", "Non-fiction", "Psychology"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655988385i/40121378.jpg",
            "price": 169.99,
            "language": "English",
            "binding": "Hardcover",
            "tags": ["Best Seller", "Trending"],
            "discount": 5,
            "rating":4.5,
            "stock":300
        },
        {
            "title": "The Alchemist",
            "author": "Paulo Coelho",
            "publishYear": 1988,
            "description": "A philosophical book about a young shepherd in search of treasure.Combining magic, mysticism, wisdom, and wonder into an inspiring tale of self-discovery, The Alchemist has become a modern classic, selling millions of copies around the world and transforming the lives of countless readers across generations.Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, following our dreams.",
            "category": ["Fiction", "Fantasy", "Adventure"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654371463i/18144590.jpg",
            "price": 135.99,
            "language": "English",
            "binding": "Paperback",
            "tags": ["Best Seller", "International Best Sellers"],
            "discount": 20,
            "rating":4.5,
            "stock":300
        },
        {
            "title": "The Four Agreements",
            "author": "Don Miguel Ruiz",
            "publishYear": 1997,
            "description": "A practical guide to personal freedom, based on ancient Toltec wisdom.In The Four Agreements, don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, the Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love. The Four Agreements are: Be Impeccable With Your Word, Don't Take Anything Personally, Don't Make Assumptions, Always Do Your Best.",
            "category": ["Self-help", "Spirituality", "Non-fiction"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1630664059i/6596.jpg",
            "price": 128.99,
            "language": "English",
            "binding": "Paperback",
            "tags": ["Best Seller", "Trending"],
            "discount": 10,
            "rating":4.5,
            "stock":290
        },
        {
            "title": "Normal People",
            "author": "Sally Rooney",
            "publishYear": 2018,
            "description": "A novel about the complex relationship between two people from different backgrounds.At school Connell and Marianne pretend not to know each other. He's popular and well-adjusted, star of the school soccer team while she is lonely, proud, and intensely private. But when Connell comes to pick his mother up from her housekeeping job at Marianne's house, a strange and indelible connection grows between the two teenagers - one they are determined to conceal.A year later, they’re both studying at Trinity College in Dublin. Marianne has found her feet in a new social world while Connell hangs at the sidelines, shy and uncertain. Throughout their years in college, Marianne and Connell circle one another, straying toward other people and possibilities but always magnetically, irresistibly drawn back together. Then, as she veers into self-destruction and he begins to search for meaning elsewhere, each must confront how far they are willing to go to save the other.",
            "category": ["Fiction", "Romance", "Contemporary"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1571423190i/41057294.jpg",
            "price": 180,
            "language": "English",
            "binding": "Hardcover",
            "tags": ["Best Seller", "Trending"],
            "discount": 5,
            "rating":4.5,
            "stock":700
        },
        {
            "title": "Dune",
            "author": "Frank Herbert",
            "publishYear": 1965,
            "description": "A science fiction novel set in a distant future amidst a huge interstellar empire.Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the “spice” melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for...When House Atreides is betrayed, the destruction of Paul's family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad'Dib, he will bring to fruition humankind’s most ancient and unattainable dream.",
            "category": ["Fiction", "Science Fiction", "Fantasy"],
            "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1555447414i/44767458.jpg",
            "price": 199.99,
            "language": "English",
            "binding": "Hardcover",
            "tags": ["Best Seller", "International Best Sellers"],
            "discount": 10,
            "rating":4.5,
            "stock":300
        } , 
        
            {
                "title": "1984",
                "author": "George Orwell",
                "publishYear": 1949,
                "description": "A dystopian novel set in a totalitarian society under constant surveillance.A masterpiece of rebellion and imprisonment where war is peace freedom is slavery and Big Brother is watching Thought Police Big Brother Orwellian These words have entered our vocabulary because of George Orwell s classic dystopian novel 1984 The story of one man s nightmare odyssey as he pursues a forbidden love affair through a world ruled by warring states and a power structure that controls not only information but also individual thought and memory 1984 is a prophetic haunting tale More relevant than ever before 1984 exposes the worst crimes imaginable the destruction of truth freedom and individuality With a foreword by Thomas Pynchon With a foreword by Thomas Pynchon A masterpiece of rebellion and imprisonment where war is peace freedom is slavery and Big Brother is watching View our feature on George Orwell s 1984 Thought Police Big Brother Orwellian These words have entered our vocabulary because of George Orwell s classic dystopian novel 1984 The story of one man s nightmare odyssey as he pursues a forbidden love affair through a world ruled by warring states and a power structure that controls not only information but also individual thought and memory 1984 is a prophetic haunting tale More relevant than ever before 1984 exposes the worst crimes imaginable the destruction of truth freedom and individuality This beautiful paperback edition features deckled edges and french flaps a perfect gift for any occasion",
                "category": ["Fiction", "Dystopian", "Classic"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1657781256i/61439040.jpg",
                "price": 145.99,
                "language": "English",
                "binding": "Paperback",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 15,
                "rating":4.5,
                "stock":400
            },
            {
                "title": "The Catcher in the Rye",
                "author": "J.D. Salinger",
                "publishYear": 1951,
                "description": "A novel about the experiences of a young man in New York City.Fleeing the crooks at Pencey Prep, he pinballs around New York City seeking solace in fleeting encounters—shooting the bull with strangers in dive hotels, wandering alone round Central Park, getting beaten up by pimps and cut down by erstwhile girlfriends. The city is beautiful and terrible, in all its neon loneliness and seedy glamour, its mingled sense of possibility and emptiness. Holden passes through it like a ghost, thinking always of his kid sister Phoebe, the only person who really understands him, and his determination to escape the phonies and find a life of true meaning.The Catcher in the Rye is an all-time classic in coming-of-age literature- an elegy to teenage alienation, capturing the deeply human need for connection and the bewildering sense of loss as we leave childhood behind.",
                "category": ["Fiction", "Classic", "Young Adult"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1398034300i/5107.jpg",
                "price": 100.99,
                "language": "English",
                "binding": "Paperback",
                "tags": ["Best Seller", "Trending"],
                "discount": 0,
                "rating":4.5,
                "stock":300
            },
            {
                "title": "The Great Gatsby",
                "author": "F. Scott Fitzgerald",
                "publishYear": 1925,
                "description": "A novel about the American dream and the Roaring Twenties.The Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story of the fabulously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted 'gin was the national drink and sex the national obsession,' it is an exquisitely crafted tale of America in the 1920s.",
                "category": ["Fiction", "Classic", "Historical"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1490528560i/4671.jpg",
                "price": 135.99,
                "language": "English",
                "binding": "Paperback",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 10,
                "rating":4.5,
                "stock":900
            },
            {
                "title": "To Kill a Mockingbird",
                "author": "Harper Lee",
                "publishYear": 1960,
                "description": "A novel about racial injustice in the Deep South.The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. 'To Kill A Mockingbird' became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.",
                "category": ["Fiction", "Classic", "Historical"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1582303449i/29008550.jpg",
                "price": 150.99,
                "language": "English",
                "binding": "Hardcover",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 5,
                "rating":4.5,
                "stock":800
            },
            {
                "title": "Pride and Prejudice",
                "author": "Jane Austen",
                "publishYear": 1813,
                "description": "A romantic novel about manners and matrimonial machinations.Since its immediate success in 1813, Pride and Prejudice has remained one of the most popular novels in the English language. Jane Austen called this brilliant work 'her own darling child' and its vivacious heroine, Elizabeth Bennet, 'as delightful a creature as ever appeared in print.' The romantic clash between the opinionated Elizabeth and her proud beau, Mr. Darcy, is a splendid performance of civilized sparring. And Jane Austen's radiant wit sparkles as her characters dance a delicate quadrille of flirtation and intrigue, making this book the most superb comedy of manners of Regency England.",
                "category": ["Fiction", "Classic", "Romance"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1320399351i/1885.jpg",
                "price": 299,
                "language": "English",
                "binding": "Paperback",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 20,
                "rating":4.5,
                "stock":300
        
            },
            {
                "title": "Brave New World",
                "author": "Aldous Huxley",
                "publishYear": 1932,
                "description": "A dystopian novel about a future society driven by technology and consumerism.Aldous Huxley's profoundly important classic of world literature, Brave New World is a searching vision of an unequal, technologically-advanced future where humans are genetically bred, socially indoctrinated, and pharmaceutically anesthetized to passively uphold an authoritarian ruling order-all at the cost of our freedom, full humanity, and perhaps also our souls. “A genius [who] who spent his life decrying the onward march of the Machine” (The New Yorker), Huxley was a man of incomparable talents: equally an artist, a spiritual seeker, and one of history's keenest observers of human nature and civilization. Brave New World, his masterpiece, has enthralled and terrified millions of readers, and retains its urgent relevance to this day as both a warning to be heeded as we head into tomorrow and as thought-provoking, satisfying work of literature. Written in the shadow of the rise of fascism during the 1930s, Brave New Worldd likewise speaks to a 21st-century world dominated by mass-entertainment, technology, medicine and pharmaceuticals, the arts of persuasion, and the hidden influence of elites.",
                "category": ["Fiction", "Dystopian", "Science Fiction"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1575509280i/5129.jpg",
                "price": 128.99,
                "language": "English",
                "binding": "Paperback",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 10,
                "rating":4.5,
                "stock":380

            },
            {
                "title": "The Hobbit",
                "author": "J.R.R. Tolkien",
                "publishYear": 1937,
                "description": "A fantasy novel about the adventures of Bilbo Baggins.In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.Written for J.R.R. Tolkien's own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001).",
                "category": ["Fiction", "Fantasy", "Adventure"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1546071216i/5907.jpg",
                "price": 194.99,
                "language": "English",
                "binding": "Hardcover",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 5,
                "rating":4.5,
                "stock":300
            },
            {
                "title": "The Road",
                "author": "Cormac McCarthy",
                "publishYear": 2006,
                "description": "A post-apocalyptic novel about a father and son's journey through a desolate America.A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind. It is cold enough to crack stones, and when the snow falls it is gray. The sky is dark. Their destination is the coast, although they don't know what, if anything, awaits them there. They have nothing; just a pistol to defend themselves against the lawless bands that stalk the road, the clothes they are wearing, a cart of scavenged food—and each other.The Road is the profoundly moving story of a journey. It boldly imagines a future in which no hope remains, but in which the father and his son, “each the other's world entire,” are sustained by love. Awesome in the totality of its vision, it is an unflinching meditation on the worst and the best that we are capable of: ultimate destructiveness, desperate tenacity, and the tenderness that keeps two people alive in the face of total devastation.",
                "category": ["Fiction", "Post-Apocalyptic", "Drama"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1600241424i/6288.jpg",
                "price": 168.99,
                "language": "English",
                "binding": "Hardcover",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 10,
                "rating":4.5,
                "stock":600
            },
            {
                "title": "Harry Potter and the Sorcerer's Stone",
                "author": "J.K. Rowling",
                "publishYear": 1997,
                "description": "The first book in the Harry Potter series about a young wizard's adventures at Hogwarts.Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!",
                "category": ["Fiction", "Fantasy", "Young Adult"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1586281809i/53027676.jpg",
                "price": 200.99,
                "language": "English",
                "binding": "Hardcover",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 10,
                "rating":4.5,
                "stock":500
            },
            {
                "title": "The Da Vinci Code",
                "author": "Dan Brown",
                "publishYear": 2003,
                "description": "A mystery thriller that involves symbology and secret societies.While in Paris on business, Harvard symbologist Robert Langdon receives an urgent late-night phone call: the elderly curator of the Louvre has been murdered inside the museum. Near the body, police have found a baffling cipher. While working to solve the enigmatic riddle, Langdon is stunned to discover it leads to a trail of clues hidden in the works of Da Vinci -- clues visible for all to see -- yet ingeniously disguised by the painter.Langdon joins forces with a gifted French cryptologist, Sophie Neveu, and learns the late curator was involved in the Priory of Sion -- an actual secret society whose members included Sir Isaac Newton, Botticelli, Victor Hugo, and Da Vinci, among others.In a breathless race through Paris, London, and beyond, Langdon and Neveu match wits with a faceless powerbroker who seems to anticipate their every move. Unless Langdon and Neveu can decipher the labyrinthine puzzle in time, the Priory's ancient secret -- and an explosive historical truth -- will be lost forever.",
                "category": ["Fiction", "Mystery", "Thriller"],
                "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1579621267i/968.jpg",
                "price": 189.99,
                "language": "English",
                "binding": "Hardcover",
                "tags": ["Best Seller", "International Best Sellers"],
                "discount": 10,
                "rating":4.5,
                "stock":800
            },
            
                {
                    "title": "The Silent Patient",
                    "author": "Alex Michaelides",
                    "publishYear": 2019,
                    "description": "A psychological thriller about a woman who stops speaking after committing a violent act.Alicia Berenson's life is seemingly perfect. A famous painter married to an in-demand fashion photographer, she lives in a grand house with big windows overlooking a park in one of London's most desirable areas. One evening her husband Gabriel returns home late from a fashion shoot, and Alicia shoots him five times in the face, and then never speaks another word.Alicia's refusal to talk, or give any kind of explanation, turns a domestic tragedy into something far grander, a mystery that captures the public imagination and casts Alicia into notoriety. The price of her art skyrockets, and she, the silent patient, is hidden away from the tabloids and spotlight at the Grove, a secure forensic unit in North London.Theo Faber is a criminal psychotherapist who has waited a long time for the opportunity to work with Alicia. His determination to get her to talk and unravel the mystery of why she shot her husband takes him down a twisting path into his own motivations—a search for the truth that threatens to consume him....",
                    "category": ["Fiction", "Thriller", "Mystery"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1668782119i/40097951.jpg",
                    "price": 169.99,
                    "language": "English",
                    "binding": "Hardcover",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "rating":4.5,
                    "stock":300
                },
                {
                    "title": "The Subtle Art of Not Giving a F*ck",
                    "author": "Mark Manson",
                    "publishYear": 2016,
                    "description": "A self-help book that emphasizes embracing life's limitations.In this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be 'positive' all the time so that we can truly become better, happier people.For decades, we've been told that positive thinking is the key to a happy, rich life. 'F**k positivity,' Mark Manson says. 'Let's be honest, shit is f**ked and we have to live with it.' In his wildly popular Internet blog, Manson doesn't sugarcoat or equivocate. He tells it like it is—a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let's-all-feel-good mindset that has infected modern society and spoiled a generation, rewarding them with gold medals just for showing up.",
                    "category": ["Self-help", "Non-fiction", "Psychology"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1685834422i/49682914.jpg",
                    "price": 146.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":5,
                    "stock":800
                },
                {
                    "title": "The Goldfinch",
                    "author": "Donna Tartt",
                    "publishYear": 2013,
                    "description": "A novel that traces the life of a boy who survives an explosion at a museum.Aged thirteen, Theo Decker, son of a devoted mother and a reckless, largely absent father, survives an accident that otherwise tears his life apart. Alone and rudderless in New York, he is taken in by the family of a wealthy friend. He is tormented by an unbearable longing for his mother, and down the years clings to the thing that most reminds him of her: a small, strangely captivating painting that ultimately draws him into the criminal underworld. As he grows up, Theo learns to glide between the drawing rooms of the rich and the dusty antiques store where he works. He is alienated and in love - and his talisman, the painting, places him at the centre of a narrowing, ever more dangerous circle.The Goldfinch is a haunted odyssey through present-day America and a drama of enthralling power. Combining unforgettably vivid characters and thrilling suspense, it is a beautiful, addictive triumph - a sweeping story of loss and obsession, of survival and self-invention, of the deepest mysteries of love, identity and fate.",
                    "category": ["Fiction", "Literary", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1378710146i/17333223.jpg",
                    "price": 180.99,
                    "language": "English",
                    "binding": "Hardcover",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 15,
                    "rating":5,
                    "stock":350
                },
                {
                    "title": "Thinking, Fast and Slow",
                    "author": "Daniel Kahneman",
                    "publishYear": 2011,
                    "description": "A book that delves into the two systems of thinking that drive our decisions.In the highly anticipated Thinking, Fast and Slow, Kahneman takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think. System 1 is fast, intuitive, and emotional; System 2 is slower, more deliberative, and more logical. Kahneman exposes the extraordinary capabilities—and also the faults and biases—of fast thinking, and reveals the pervasive influence of intuitive impressions on our thoughts and behavior. The impact of loss aversion and overconfidence on corporate strategies, the difficulties of predicting what will make us happy in the future, the challenges of properly framing risks at work and at home, the profound effect of cognitive biases on everything from playing the stock market to planning the next vacation—each of these can be understood only by knowing how the two systems work together to shape our judgments and decisions.Engaging the reader in a lively conversation about how we think, Kahneman reveals where we can and cannot trust our intuitions and how we can tap into the benefits of slow thinking. He offers practical and enlightening insights into how choices are made in both our business and our personal lives—and how we can use different techniques to guard against the mental glitches that often get us into trouble. Thinking, Fast and Slow will transform the way you think about thinking.",
                    "category": ["Non-fiction", "Psychology", "Science"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1317793965i/11468377.jpg",
                    "price": 170.00,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":5,
                    "stock":300
                },
                {
                    "title": "The Handmaid's Tale",
                    "author": "Margaret Atwood",
                    "publishYear": 1985,
                    "description": "A dystopian novel about a totalitarian regime that treats women as property.Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the years before, when she lived and made love with her husband, Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now…Funny, unexpected, horrifying, and altogether convincing, The Handmaid's Tale is at once scathing satire, dire warning, and tour de force.",
                    "category": ["Fiction", "Dystopian", "Classic"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1578028274i/38447.jpg",
                    "price": 150.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":5,
                    "stock":300
                },
                {
                    "title": "The Power of Habit",
                    "author": "Charles Duhigg",
                    "publishYear": 2012,
                    "description": "A book that explores the science behind why habits exist and how they can be changed.A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed.Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figure out how to sell a new product called Febreze, on track to be one of the biggest flops in company history. Suddenly, one of them detects a nearly imperceptible pattern—and with a slight shift in advertising, Febreze goes on to earn a billion dollars a year.An untested CEO takes over one of the largest companies in America. His first order of business is attacking a single pattern among his employees—how they approach worker safety—and soon the firm, Alcoa, becomes the top performer in the Dow Jones.",
                    "category": ["Self-help", "Non-fiction", "Psychology"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1545854312i/12609433.jpg",
                    "price": 160.99,
                    "language": "English",
                    "binding": "Hardcover",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":4,
                    "stock":800
                },
                {
                    "title": "Little Fires Everywhere",
                    "author": "Celeste Ng",
                    "publishYear": 2017,
                    "description": "A novel about the intertwined fates of the picture-perfect Richardson family and an enigmatic mother and daughter.Everyone in Shaker Heights was talking about it that summer: how Isabelle, the last of the Richardson children, had finally gone around the bend and burned the house down.In Shaker Heights, a placid, progressive suburb of Cleveland, everything is meticulously planned - from the layout of the winding roads, to the colours of the houses, to the successful lives its residents will go on to lead. And no one embodies this spirit more than Elena Richardson, whose guiding principle is playing by the rules.Enter Mia Warren - an enigmatic artist and single mother - who arrives in this idyllic bubble with her teenage daughter Pearl, and rents a house from the Richardsons. Soon Mia and Pearl become more than just tenants: all four Richardson children are drawn to the mother-daughter pair. But Mia carries with her a mysterious past, and a disregard for the rules that threatens to upend this carefully ordered community.",
                    "category": ["Fiction", "Drama", "Contemporary"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1522684533i/34273236.jpg",
                    "price": 140.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Giver",
                    "author": "Lois Lowry",
                    "publishYear": 1993,
                    "description": "A dystopian novel about a boy who learns the truth about his seemingly perfect society.At the age of twelve, Jonas, a young boy from a seemingly utopian, futuristic world, is singled out to receive special training from The Giver, who alone holds the memories of the true joys and pain of life.",
                    "category": ["Fiction", "Dystopian", "Young Adult"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1342493368i/3636.jpg",
                    "price": 120.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "Eleanor Oliphant Is Completely Fine",
                    "author": "Gail Honeyman",
                    "publishYear": 2017,
                    "description": "A novel about an eccentric and socially awkward woman who learns to navigate life.Meet Eleanor Oliphant: She struggles with appropriate social skills and tends to say exactly what she's thinking. Nothing is missing in her carefully timetabled life of avoiding social interactions, where weekends are punctuated by frozen pizza, vodka, and phone chats with Mummy.But everything changes when Eleanor meets Raymond, the bumbling and deeply unhygienic IT guy from her office. When she and Raymond together save Sammy, an elderly gentleman who has fallen on the sidewalk, the three become the kinds of friends who rescue one another from the lives of isolation they have each been living. And it is Raymond's big heart that will ultimately help Eleanor find the way to repair her own profoundly damaged one.",
                    "category": ["Fiction", "Contemporary", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1557858891i/35900387.jpg",
                    "price": 130.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "Good Omens",
                    "author": "Neil Gaiman and Terry Pratchett",
                    "publishYear": 1990,
                    "description": "A comedic novel about an angel and a demon teaming up to prevent the apocalypse.According to the Nice and Accurate Prophecies of Agnes Nutter - the world's only totally reliable guide to the future - the world will end on a Saturday. Next Saturday, in fact. Just after tea...People have been predicting the end of the world almost from its very beginning, so it's only natural to be sceptical when a new date is set for Judgement Day. This time though, the armies of Good and Evil really do appear to be massing. The four Bikers of the Apocalypse are hitting the road. But both the angels and demons - well, one fast-living demon and a somewhat fussy angel - would quite like the Rapture not to happen.",
                    "category": ["Fiction", "Fantasy", "Comedy"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1615552073i/12067.jpg",
                    "price": 150.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 5,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Night Circus",
                    "author": "Erin Morgenstern",
                    "publishYear": 2011,
                    "description": "A fantasy novel about a magical competition between two young illusionists.The circus arrives without warning. No announcements precede it. It is simply there, when yesterday it was not. Within the black-and-white striped canvas tents is an utterly unique experience full of breathtaking amazements. It is called Le Cirque des Rêves, and it is only open at night.But behind the scenes, a fierce competition is underway—a duel between two young magicians, Celia and Marco, who have been trained since childhood expressly for this purpose by their mercurial instructors. Unbeknownst to them, this is a game in which only one can be left standing, and the circus is but the stage for a remarkable battle of imagination and will. Despite themselves, however, Celia and Marco tumble headfirst into love—a deep, magical love that makes the lights flicker and the room grow warm whenever they so much as brush hands.True love or not, the game must play out, and the fates of everyone involved, from the cast of extraordinary circus performers to the patrons, hang in the balance, suspended as precariously as the daring acrobats overhead.",
                    "category": ["Fiction", "Fantasy", "Romance"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1387124618i/9361589.jpg",
                    "price": 140.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Martian",
                    "author": "Andy Weir",
                    "publishYear": 2011,
                    "description": "A science fiction novel about an astronaut stranded on Mars who must use his ingenuity to survive.After a dust storm nearly kills him and forces his crew to evacuate while thinking him dead, Mark finds himself stranded and completely alone with no way to even signal Earth that he's alive—and even if he could get word out, his supplies would be gone long before a rescue could arrive.Chances are, though, he won’t have time to starve to death. The damaged machinery, unforgiving environment, or plain-old “human error” are much more likely to kill him first.But Mark isn't ready to give up yet. Drawing on his ingenuity, his engineering skills — and a relentless, dogged refusal to quit — he steadfastly confronts one seemingly insurmountable obstacle after the next. Will his resourcefulness be enough to overcome the impossible odds against him?",
                    "category": ["Fiction", "Science Fiction", "Adventure"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1413706054i/18007564.jpg",
                    "price": 130.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":4,
                    "stock":400
                },
                {
                    "title": "The Girl on the Train",
                    "author": "Paula Hawkins",
                    "publishYear": 2015,
                    "description": "A psychological thriller about a woman who becomes entangled in a missing persons investigation.Rachel catches the same commuter train every morning. She knows it will wait at the same signal each time, overlooking a row of back gardens. She's even started to feel like she knows the people who live in one of the houses. “Jess and Jason,” she calls them. Their life—as she sees it—is perfect. If only Rachel could be that happy. And then she sees something shocking. It's only a minute until the train moves on, but it's enough. Now everything's changed. Now Rachel has a chance to become a part of the lives she's only watched from afar. Now they'll see; she's much more than just the girl on the train...",
                    "category": ["Fiction", "Thriller", "Mystery"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1574805682i/22557272.jpg",
                    "price": 150.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "Gone Girl",
                    "author": "Gillian Flynn",
                    "publishYear": 2012,
                    "description": "A mystery thriller about a woman who goes missing on her fifth wedding anniversary.These are the questions Nick Dunne finds himself asking on the morning of his fifth wedding anniversary when his wife Amy suddenly disappears. The police suspect Nick. Amy's friends reveal that she was afraid of him, that she kept secrets from him. He swears it isn't true. A police examination of his computer shows strange searches. He says they weren't made by him. And then there are the persistent calls on his mobile phone.",
                    "category": ["Fiction", "Mystery", "Thriller"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1554086139i/19288043.jpg",
                    "price": 160.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Underground Railroad",
                    "author": "Colson Whitehead",
                    "publishYear": 2016,
                    "description": "A novel that reimagines the historical Underground Railroad as an actual railroad system.Like millions of my race, my mother and father were born slaves, but were not contented to live and die so. My father purchased himself in early manhood by hard toil. Mother saw no way for herself and children to escape the horrors of bondage but by flight. Bravely, with her four little ones, with firm faith in God and an ardent desire to be free, she forsook the prison-house, and succeeded, through the aid of my father, to reach a free State. Here life had to be begun anew. The old familiar slave names had to be changed, and others, for prudential reasons, had to be found. This was not hard work. However, hardly months had passed ere the keen scent of the slave-hunters had trailed them to where they had fancied themselves secure. In those days all power was in the hands of the oppressor, and the capture of a slave mother and her children was attended with no great difficulty other than the crushing of freedom in the breast of the victims. Without judge or jury, all were hurried back to wear the yoke again. But back this mother was resolved never to stay. She only wanted another opportunity to again strike for freedom. In a few months after being carried back, with only two of her little ones, she took her heart in her hand and her babes in her arms, and this trial was a success. Freedom was gained, although not without the sad loss of her two older children, whom she had to leave behind...",
                    "category": ["Fiction", "Historical", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1493178362i/30555488.jpg",
                    "price": 170.99,
                    "language": "English",
                    "binding": "Hardcover",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 0,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "A Song of Ice and Fire (Game of Thrones)",
                    "author": "George R.R. Martin",
                    "publishYear": 1996,
                    "description": "A fantasy epic series set in the fictional continents of Westeros and Essos.Long ago, in a time forgotten, a preternatural event threw the seasons out of balance. In a land where summers can last decades and winters a lifetime, trouble is brewing. The cold is returning, and in the frozen wastes to the north of Winterfell, sinister forces are massing beyond the kingdom's protective Wall. To the south, the king's powers are failing—his most trusted adviser dead under mysterious circumstances and his enemies emerging from the shadows of the throne. At the center of the conflict lie the Starks of Winterfell, a family as harsh and unyielding as the frozen land they were born to. Now Lord Eddard Stark is reluctantly summoned to serve as the king's new Hand, an appointment that threatens to sunder not only his family but the kingdom itself.Sweeping from a harsh land of cold to a summertime kingdom of epicurean plenty, A Game of Thrones tells a tale of lords and ladies, soldiers and sorcerers, assassins and bastards, who come together in a time of grim omens. Here an enigmatic band of warriors bear swords of no human metal; a tribe of fierce wildlings carry men off into madness; a cruel young dragon prince barters his sister to win back his throne; a child is lost in the twilight between life and death; and a determined woman undertakes a treacherous journey to protect all she holds dear. Amid plots and counter-plots, tragedy and betrayal, victory and terror, allies and enemies, the fate of the Starks hangs perilously in the balance, as each side endeavors to win that deadliest of conflicts: the game of thrones.",
                    "category": ["Fiction", "Fantasy", "Epic"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1562726234i/13496.jpg",
                    "price": 199.99,
                    "language": "English",
                    "binding": "Hardcover",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 15,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Kite Runner",
                    "author": "Khaled Hosseini",
                    "publishYear": 2003,
                    "description": "A novel about the friendship between two boys growing up in Afghanistan.1970s Afghanistan: Twelve-year-old Amir is desperate to win the local kite-fighting tournament and his loyal friend Hassan promises to help him. But neither of the boys can foresee what would happen to Hassan that afternoon, an event that is to shatter their lives. After the Russians invade and the family is forced to flee to America, Amir realises that one day he must return to an Afghanistan under Taliban rule to find the one thing that his new world cannot grant him: redemption.",
                    "category": ["Fiction", "Drama", "Historical"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1579036753i/77203.jpg",
                    "price": 120.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Book Thief",
                    "author": "Markus Zusak",
                    "publishYear": 2005,
                    "description": "A novel set in Nazi Germany, narrated by Death, about a young girl who steals books and shares them with her neighbors.By her brother's graveside, Liesel's life is changed when she picks up a single object, partially hidden in the snow. It is The Gravedigger's Handbook, left behind there by accident, and it is her first act of book thievery. So begins a love affair with books and words, as Liesel, with the help of her accordian-playing foster father, learns to read. Soon she is stealing books from Nazi book-burnings, the mayor's wife's library, wherever there are books to be found.",
                    "category": ["Fiction", "Historical", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1522157426i/19063.jpg",
                    "price": 149.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 5,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Hunger Games",
                    "author": "Suzanne Collins",
                    "publishYear": 2008,
                    "description": "The first book in a dystopian trilogy about a girl who volunteers to take her sister's place in a televised fight to the death.In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love.",
                    "category": ["Fiction", "Dystopian", "Young Adult"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722975i/2767052.jpg",
                    "price": 110.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers","24 hr deals"],
                    "discount": 0,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Help",
                    "author": "Kathryn Stockett",
                    "publishYear": 2009,
                    "description": "A novel set in the 1960s American South that explores racial segregation and the relationships between maids and their employers.Twenty-two-year-old Skeeter has just returned home after graduating from Ole Miss. She may have a degree, but it is 1962, Mississippi, and her mother will not be happy till Skeeter has a ring on her finger. Skeeter would normally find solace with her beloved maid Constantine, the woman who raised her, but Constantine has disappeared and no one will tell Skeeter where she has gone.Aibileen is a black maid, a wise, regal woman raising her seventeenth white child. Something has shifted inside her after the loss of her own son, who died while his bosses looked the other way. She is devoted to the little girl she looks after, though she knows both their hearts may be broken.Minny, Aibileen's best friend, is short, fat, and perhaps the sassiest woman in Mississippi. She can cook like nobody's business, but she can't mind her tongue, so she's lost yet another job. Minny finally finds a position working for someone too new to town to know her reputation. But her new boss has secrets of her own.Seemingly as different from one another as can be, these women will nonetheless come together for a clandestine project that will put them all at risk. And why? Because they are suffocating within the lines that define their town and their times. And sometimes lines are made to be crossed.",
                    "category": ["Fiction", "Historical", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1622355533i/4667024.jpg",
                    "price": 139.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":4,
                    "stock":300
                },
                {
                    "title": "The Shadow of the Wind",
                    "author": "Carlos Ruiz Zafón",
                    "publishYear": 2001,
                    "description": "A novel set in post-war Barcelona about a young boy who discovers a mysterious book that changes his life.Barcelona, 1945: A city slowly heals from its war wounds, and Daniel, an antiquarian book dealer's son who mourns the loss of his mother, finds solace in a mysterious book entitled The Shadow of the Wind, by one Julian Carax. But when he sets out to find the author's other works, he makes a shocking discovery: someone has been systematically destroying every copy of every book Carax has written. In fact, Daniel may have the last of Carax's books in existence. Soon Daniel's seemingly innocent quest opens a door into one of Barcelona's darkest secrets--an epic story of murder, madness, and doomed love.",
                    "category": ["Fiction", "Mystery", "Historical"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1628791882i/1232.jpg",
                    "price": 159.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":5,
                    "stock":400
                },
                {
                    "title": "The Nightingale",
                    "author": "Kristin Hannah",
                    "publishYear": 2015,
                    "description": "A novel about two sisters in Nazi-occupied France and their struggle to survive and resist.In the quiet village of Carriveau, Vianne Mauriac says good-bye to her husband, Antoine, as he heads for the Front. She doesn't believe that the Nazis will invade France…but invade they do, in droves of marching soldiers, in caravans of trucks and tanks, in planes that fill the skies and drop bombs upon the innocent. When a German captain requisitions Vianne's home, she and her daughter must live with the enemy or lose everything. Without food or money or hope, as danger escalates all around them, she is forced to make one impossible choice after another to keep her family alive.Vianne's sister, Isabelle, is a rebellious eighteen-year-old, searching for purpose with all the reckless passion of youth. While thousands of Parisians march into the unknown terrors of war, she meets Gaëtan, a partisan who believes the French can fight the Nazis from within France, and she falls in love as only the young can…completely. But when he betrays her, Isabelle joins the Resistance and never looks back, risking her life time and again to save others.",
                    "category": ["Fiction", "Historical", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1681839850i/21853621.jpg",
                    "price": 169.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending","24 hr deals"],
                    "discount": 5,
                    "rating":5,
                    "stock":350
                },
                {
                    "title": "The Secret History",
                    "author": "Donna Tartt",
                    "publishYear": 1992,
                    "description": "A novel about a group of classics students at an elite college who become entangled in murder.Under the influence of their charismatic classics professor, a group of clever, eccentric misfits at an elite New England college discover a way of thinking and living that is a world away from the humdrum existence of their contemporaries. But when they go beyond the boundaries of normal morality they slip gradually from obsession to corruption and betrayal, and at last—inexorably—into evil.",
                    "category": ["Fiction", "Mystery", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1451554846i/29044.jpg",
                    "price": 149.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":5,
                    "stock":300
                },
                {
                    "title": "All the Light We Cannot See",
                    "author": "Anthony Doerr",
                    "publishYear": 2014,
                    "description": "A novel set during World War II that follows the intersecting lives of a blind French girl and a German boy.Marie-Laure lives in Paris near the Museum of Natural History, where her father works. When she is twelve, the Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo, where Marie-Laure's reclusive great uncle lives in a tall house by the sea. With them they carry what might be the museum's most valuable and dangerous jewel.In a mining town in Germany, Werner Pfennig, an orphan, grows up with his younger sister, enchanted by a crude radio they find that brings them news and stories from places they have never seen or imagined. Werner becomes an expert at building and fixing these crucial new instruments and is enlisted to use his talent to track down the resistance. Deftly interweaving the lives of Marie-Laure and Werner, Doerr illuminates the ways, against all odds, people try to be good to one another.From the highly acclaimed, multiple award-winning Anthony Doerr, the stunningly beautiful instant New York Times bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.",
                    "category": ["Fiction", "Historical", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1451445646i/18143977.jpg",
                    "price": 179.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "rating":5,
                    "stock":400
                },
                {
                    "title": "The Seven Husbands of Evelyn Hugo",
                    "author": "Taylor Jenkins Reid",
                    "publishYear": 2017,
                    "description": "A novel about a reclusive Hollywood icon who reveals the truth about her glamorous and scandalous life.Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now?Monique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career.Summoned to Evelyn's luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the '80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn's story nears its conclusion, it becomes clear that her life intersects with Monique's own in tragic and irreversible ways.",
                    "category": ["Fiction", "Historical", "Romance"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664458703i/32620332.jpg",
                    "price": 169.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "rating":5,
                    "stock":300
                },
                {
                    "title": "The Tattooist of Auschwitz",
                    "author": "Heather Morris",
                    "publishYear": 2018,
                    "description": "A novel based on the true story of Lale Sokolov, a Jewish man who became the tattooist at Auschwitz-Birkenau.In April 1942, Lale Sokolov, a Slovakian Jew, is forcibly transported to the concentration camps at Auschwitz-Birkenau. When his captors discover that he speaks several languages, he is put to work as a Tätowierer (the German word for tattooist), tasked with permanently marking his fellow prisoners.Imprisoned for more than two and a half years, Lale witnesses horrific atrocities and barbarism—but also incredible acts of bravery and compassion. Risking his own life, he uses his privileged position to exchange jewels and money from murdered Jews for food to keep his fellow prisoners alive.One day in July 1942, Lale, prisoner 32407, comforts a trembling young woman waiting in line to have the number 34902 tattooed onto her arm. Her name is Gita, and in that first encounter, Lale vows to somehow survive the camp and marry her.A vivid, harrowing, and ultimately hopeful re-creation of Lale Sokolov's experiences as the man who tattooed the arms of thousands of prisoners with what would become one of the most potent symbols of the Holocaust, The Tattooist of Auschwitz is also a testament to the endurance of love and humanity under the darkest possible conditions.",
                    "category": ["Fiction", "Historical", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1596365612i/54784931.jpg",
                    "price": 159.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":5,
                    "stock":300
                },
                {
                    "title": "Crazy Rich Asians",
                    "author": "Kevin Kwan",
                    "publishYear": 2013,
                    "description": "A novel about the extravagant lives of wealthy Asian families and the cultural clash between old and new money.Crazy Rich Asians is the outrageously funny debut novel about three super-rich, pedigreed Chinese families and the gossip, backbiting, and scheming that occurs when the heir to one of the most massive fortunes in Asia brings home his ABC (American-born Chinese) girlfriend to the wedding of the season.When Rachel Chu agrees to spend the summer in Singapore with her boyfriend, Nicholas Young, she envisions a humble family home, long drives to explore the island, and quality time with the man she might one day marry. What she doesn't know is that Nick's family home happens to look like a palace, that she'll ride in more private planes than cars, and that with one of Asia's most eligible bachelors on her arm, Rachel might as well have a target on her back.Initiated into a world of dynastic splendor beyond imagination, Rachel meets Astrid, the It Girl of Singapore society; Eddie, whose family practically lives in the pages of the Hong Kong socialite magazines; and Eleanor, Nick's formidable mother, a woman who has very strong feelings about who her son should—and should not—marry.Uproarious, addictive, and filled with jaw-dropping opulence, Crazy Rich Asians is an insider's look at the Asian JetSet; a perfect depiction of the clash between old money and new money; between Overseas Chinese and Mainland Chinese; and a fabulous novel about what it means to be young, in love, and gloriously, crazily rich",
                    "category": ["Fiction", "Romance", "Comedy"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1364852559i/16085481.jpg",
                    "price": 149.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":5,
                    "stock":300
                },
                {
                    "title": "One Hundred Years of Solitude",
                    "author": "Gabriel García Márquez",
                    "publishYear": 1967,
                    "description": "A multi-generational story of the Buendía family in the fictional town of Macondo.The brilliant, bestselling, landmark novel that tells the story of the Buendia family, and chronicles the irreconcilable conflict between the desire for solitude and the need for love—in rich, imaginative prose that has come to define an entire genre known as 'magical realism.'",
                    "category": ["Fiction", "Magical Realism", "Historical"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327881361i/320.jpg",
                    "price": 179.99,
                    "language": "Spanish",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":5,
                    "stock":300
                },
               
                {
                    "title": "My Name is Red",
                    "author": "Orhan Pamuk",
                    "publishYear": 1998,
                    "description": "A historical novel about the clash between East and West in the Ottoman Empire.At once a fiendishly devious mystery, a beguiling love story, and a brilliant symposium on the power of art, My Name Is Red is a transporting tale set amid the splendor and religious intrigue of sixteenth-century Istanbul, from one of the most prominent contemporary Turkish writers.The Sultan has commissioned a cadre of the most acclaimed artists in the land to create a great book celebrating the glories of his realm. Their task: to illuminate the work in the European style. But because figurative art can be deemed an affront to Islam, this commission is a dangerous proposition indeed. The ruling elite therefore mustn't know the full scope or nature of the project, and panic erupts when one of the chosen miniaturists disappears. The only clue to the mystery-or crime? -lies in the half-finished illuminations themselves. Part fantasy and part philosophical puzzle, My Name is Red is a kaleidoscopic journey to the intersection of art, religion, love, sex and power.",
                    "category": ["Fiction", "Historical", "Mystery"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1547450869i/2517.jpg",
                    "price": 189.99,
                    "language": "Turkish",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 15,
                    "rating":5,
                    "stock":500
                },
                {
                    "title": "The Girl with the Dragon Tattoo",
                    "author": "Stieg Larsson",
                    "publishYear": 2005,
                    "description": "A mystery thriller involving a journalist and a hacker uncovering family secrets.Harriet Vanger, a scion of one of Sweden's wealthiest families disappeared over forty years ago. All these years later, her aged uncle continues to seek the truth. He hires Mikael Blomkvist, a crusading journalist recently trapped by a libel conviction, to investigate. He is aided by the pierced and tattooed punk prodigy Lisbeth Salander. Together they tap into a vein of unfathomable iniquity and astonishing corruption.An international publishing sensation, Stieg Larsson's The Girl with the Dragon Tattoo combines murder mystery, family saga, love story, and financial intrigue into one satisfyingly complex and entertainingly atmospheric novel.",
                    "category": ["Fiction", "Thriller", "Mystery"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1696892687i/161552845.jpg",
                    "price": 169.99,
                    "language": "Swedish",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":5,
                    "stock":300
                },
                {
                    "title": "The Little Prince",
                    "author": "Antoine de Saint-Exupéry",
                    "publishYear": 1943,
                    "description": "A philosophical tale about a young prince traveling through space.A pilot stranded in the desert awakes one morning to see, standing before him, the most extraordinary little fellow. 'Please,' asks the stranger, 'draw me a sheep.' And the pilot realizes that when life's events are too difficult to understand, there is no choice but to succumb to their mysteries. He pulls out pencil and paper... And thus begins this wise and enchanting fable that, in teaching the secret of what is really important in life, has changed forever the world for its readers.",
                    "category": ["Fiction", "Philosophical", "Children"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1367545443i/157993.jpg",
                    "price": 129.99,
                    "language": "French",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 5,
                    "rating":5,
                    "stock":300
                },
                {
                    "title": "Blindness",
                    "author": "José Saramago",
                    "publishYear": 1995,
                    "description": "A dystopian novel about a city struck by an epidemic of blindness.A city is hit by an epidemic of 'white blindness' that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations, and assaulting women. There is one eyewitness to this nightmare who guides her charges—among them a boy with no mother, a girl with dark glasses, a dog of tears—through the barren streets, and their procession becomes as uncanny as the surroundings are harrowing. As Blindness reclaims the age-old story of a plague, it evokes the vivid and trembling horrors of the twentieth century, leaving readers with a powerful vision of the human spirit that's bound both by weakness and exhilarating strength.",
                    "category": ["Fiction", "Dystopian", "Philosophical","Social"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1528481068i/40495148.jpg",
                    "price": 149.99,
                    "language": "Portuguese",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":4,
                    "stock":250
                    

                },
                {
                    "title": "Norwegian Wood",
                    "author": "Haruki Murakami",
                    "publishYear": 1987,
                    "description": "A nostalgic story of loss and burgeoning sexuality set in 1960s Tokyo.Toru, a quiet and preternaturally serious young college student in Tokyo, is devoted to Naoko, a beautiful and introspective young woman, but their mutual passion is marked by the tragic death of their best friend years before. Toru begins to adapt to campus life and the loneliness and isolation he faces there, but Naoko finds the pressures and responsibilities of life unbearable. As she retreats further into her own world, Toru finds himself reaching out to others and drawn to a fiercely independent and sexually liberated young woman.",
                    "category": ["Fiction", "Romance", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1713542603i/11297.jpg",
                    "price": 139.99,
                    "language": "Japanese",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 5,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "The Wind-Up Bird Chronicle",
                    "author": "Haruki Murakami",
                    "publishYear": 1994,
                    "description": "A novel about a man's search for his missing wife that leads him into a netherworld beneath Tokyo.Japan's most highly regarded novelist now vaults into the first ranks of international fiction writers with this heroically imaginative novel, which is at once a detective story, an account of a disintegrating marriage, and an excavation of the buried secrets of World War II.In a Tokyo suburb a young man named Toru Okada searches for his wife's missing cat. Soon he finds himself looking for his wife as well in a netherworld that lies beneath the placid surface of Tokyo. As these searches intersect, Okada encounters a bizarre group of allies and antagonists: a psychic prostitute; a malevolent yet mediagenic politician; a cheerfully morbid sixteen-year-old-girl; and an aging war veteran who has been permanently changed by the hideous things he witnessed during Japan's forgotten campaign in Manchuria.Gripping, prophetic, suffused with comedy and menace, The Wind-Up Bird Chronicle is a tour de force equal in scope to the masterpieces of Mishima and Pynchon.",
                    "category": ["Fiction", "Mystery", "Magical Realism","Fantasy"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327872639i/11275.jpg",
                    "price": 179.99,
                    "language": "Japanese",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":3,
                    "stock":500
                },
                {
                    "title": "Crime and Punishment",
                    "author": "Fyodor Dostoevsky",
                    "publishYear": 1866,
                    "description": "A philosophical novel about the mental anguish and moral dilemmas of a poor ex-student who plans to kill a pawnbroker.Raskolnikov, a destitute and desperate former student, wanders through the slums of St Petersburg and commits a random murder without remorse or regret. He imagines himself to be a great man, a Napoleon: acting for a higher purpose beyond conventional moral law. But as he embarks on a dangerous game of cat and mouse with a suspicious police investigator, Raskolnikov is pursued by the growing voice of his conscience and finds the noose of his own guilt tightening around his neck. Only Sonya, a downtrodden sex worker, can offer the chance of redemption.",
                    "category": ["Fiction", "Philosophical", "Classic","Dystopian"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1382846449i/7144.jpg",
                    "price": 189.99,
                    "language": "Russian",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 15,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "गोदान (Godan)",
                    "author": "मुंशी प्रेमचंद (Munshi Premchand)",
                    "publishYear": 1936,
                    "description": "भारत के ग्रामीण जीवन की सजीव तस्वीर प्रस्तुत करता एक उपन्यास।गोदान, प्रेमचन्द का अंतिम एवम् सबसे महत्त्वपूर्ण उपन्यास माना जाता है। कुछ लोग इसे उनकी सर्वोत्तम कृति भी मानते हैं। इसका प्रकाशन १९३६ ई० में हिन्दी ग्रन्थ रत्नाकर कार्यालय, बम्बई द्वारा किया गया था। इसमें भारतीय ग्राम समाज एवं परिवेश का सजीव चित्रण है। गोदान ग्राम्य जीवन और कृषि संस्कृति का महाकाव्य माना जाता है।",
                    "category": ["Fiction", "Classic", "Drama"],
                    "imageUrl": "https://m.media-amazon.com/images/I/81ePoyTbAoL._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 129.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "राग दरबारी (Raag Darbari)",
                    "author": "श्रीलाल शुक्ल (Shrilal Shukla)",
                    "publishYear": 1968,
                    "description": "व्यंग्य के माध्यम से भारतीय समाज और राजनीति पर कटाक्ष करता उपन्यास।रागदरबारी विख्यात हिन्दी साहित्यकार श्रीलाल शुक्ल की प्रसिद्ध व्यंग्य रचना है जिसके लिये उन्हें सन् 1969 में साहित्य अकादमी पुरस्कार से सम्मानित किया गया। यह ऐसा उपन्यास है जो गाँव की कथा के माध्यम से आधुनिक भारतीय जीवन की मूल्यहीनता को सहजता और निर्ममता से अनावृत करता है।",
                    "category": ["Fiction", "Satire", "Drama"],
                    "imageUrl": "https://m.media-amazon.com/images/I/91lTTaDHHAS._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 140.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 5,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "मधुशाला (Madhushala)",
                    "author": "हरिवंश राय बच्चन (Harivansh Rai Bachchan)",
                    "publishYear": 1935,
                    "description": "मदिरा और जीवन के विभिन्न पहलुओं को दर्शाती एक काव्य रचना।हरिवंशराय ‘बच्चन’ की अमर काव्य-रचना 'मधुशाला' 1935 से लगातार प्रकाशित होती आ रही है। सूफियाना रंगत की 135 रुबाइयों से गूँथी गई इस कविता की हर रुबाई का अंत ‘मधुशाला’ शब्द से होता है। पिछले आठ दशकों से कई-कई पीढ़ियों के लोग इसे गाते-गुनगुनाते रहे हैं। यह एक ऐसी कविता है, जिसमें हमारे आस-पास का जीवन-संगीत भरपूर आध्यात्मिक ऊँचाइयों से गूँजता प्रतीत होता हमधुशाला का रसपान लाखों लोग अब तक कर चुके हैं और भविष्य में भी करते रहेंगे, यह ‘कविता का प्याला’ कभी खाली होने वाला नहीं है, जैसा बच्चन जी ने स्वयं लिखा है - भावुकता अंगूर लता से खींच कल्पना की हाला, कवि साकी बनकर आया है भरकर कविता का प्याला; कभी न कण भर खाली होगा, लाख पिएँ, दो लाख पिएँ! पाठक गण हैं पीनेवाले, पुस्तक मेरी मधुशाला।",
                    "category": ["Poetry", "Classic", "Philosophical"],
                    "imageUrl": "https://m.media-amazon.com/images/I/71VVm4pMYvL._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 311.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "चित्रलेखा (Chitralekha)",
                    "author": "भगवतीचरण वर्मा (Bhagwati Charan Verma)",
                    "publishYear": 1934,
                    "description": "प्रेम और अध्यात्म के द्वंद्व को प्रस्तुत करता एक उपन्यास।चित्रलेखा न केवल भगवतीचरण वर्मा को एक उपन्यासकार के रूप में प्रतिष्ठा दिलानेवाला पहला उपन्यास है बल्कि हिन्दी के उन विरले उपन्यासों में भी गणनीय है, जिनकी लोकप्रियता बराबर काल की सीमा को लाँघती रही है। चित्रलेखा की कथा पाप और पुण्य की समस्या पर आधारित है। पाप क्या है? उसका न कहाँ है?—इन प्रश्नों का उत्तर खोजने के लिए महाप्रभु रत्नाम्बर के दो शिष्य, श्वेतांक और विशालदेव, क्रमश: सामंत बीजगुप्त और योगी कुमारगिरि की शरण में जाते हैं। इनके साथ रहते हुए श्वेतांक और विशालदेव नितान्त भिन्न जीवनानुभवों से गुजरते हैं। और उनके निष्कर्षों पर महाप्रभु रत्नाम्बर की टिप्पणी है: ‘‘संसार में पाप कुछ भी नहीं है, यह केवल मनुष्य के दृष्टिकोण की विषमता का दूसरा नाम है। हम न पाप करते हैं और न पुण्य करते हैं, हम केवल वह करते हैं जो हमें करना पड़ता है।’’.",
                    "category": ["Fiction", "Philosophical", "Romance"],
                    "imageUrl": "https://m.media-amazon.com/images/I/61o49pHzjBL._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 139.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":3,
                    "stock":400
                },
                {
                    "title": "गुनाहों का देवता (Gunaho Ka Devta)",
                    "author": "धर्मवीर भारती (Dharamveer Bharti)",
                    "publishYear": 1949,
                    "description": "प्रेम और बलिदान की एक मार्मिक कहानी।गुनाहों का देवता ( शाब्दिक अर्थ : गुनाहों का देवता) धर्मवीर भारती द्वारा 1949 में लिखा गया एक हिंदी उपन्यास है। इसकी कहानी भारत में ब्रिटिश शासन के दौरान इलाहाबाद में घटित होती है। कहानी के चार मुख्य पात्र हैं: चंदर, सुधा, विनती और पम्मी। समय के साथ, उपन्यास ने ऐतिहासिक महत्व प्राप्त किया और पाठकों के बीच लोकप्रिय हुआ।",
                    "category": ["Fiction", "Romance", "Drama"],
                    "imageUrl": "https://m.media-amazon.com/images/I/41DdeYNfqLL._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 129.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers" , "24 hr deals"],
                    "discount": 10,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "तमस (Tamas)",
                    "author": "भीष्म साहनी (Bhisham Sahni)",
                    "publishYear": 1973,
                    "description": "1947 के भारत-पाक विभाजन के दौरान की त्रासदी पर आधारित उपन्यास।तमस भीष्म साहनी का सबसे प्रसिद्ध उपन्यास है। इसका प्रकाशन 1973 में हुआ था। वे इस उपन्यास से साहित्य जगत में बहुत लोकप्रिय हुए थे। तमस को १९७५ में साहित्य अकादमी पुरस्कार से भी सम्मानित किया गया था। इस पर १९८६ में गोविंद निहलानी ने दूरदर्शन धारावाहिक तथा एक फ़िल्म भी बनाई थी।",
                    "category": ["Fiction", "Historical", "Drama"],
                    "imageUrl": "https://m.media-amazon.com/images/I/81faMT-cnzL._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 149.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "मैला आँचल (Maila Anchal)",
                    "author": "फणीश्वर नाथ रेणु (Phanishwar Nath Renu)",
                    "publishYear": 1954,
                    "description": "ग्रामीण भारत के जीवन को चित्रित करता उपन्यास।मैला आँचल फणीश्वरनाथ 'रेणु' का प्रतिनिधि उपन्यास है। यह हिन्दी का श्रेष्ठ और सशक्त आंचलिक उपन्यास है। नेपाल की सीमा से सटे उत्तर-पूर्वी बिहार के एक पिछड़े ग्रामीण अंचल को पृष्ठभूमि बनाकर रेणु ने इसमें वहाँ के जीवन का अत्यन्त जीवन्त और मुखर चित्रण किया है जिससे वह स्वयं ही घनिष्ट रूप से जुड़े हुए थे।",
                    "category": ["Fiction", "Classic", "Drama"],
                    "imageUrl": "https://m.media-amazon.com/images/I/71VlU8PZ36L._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 139.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "कुरु कुरु स्वाहा (Kuru Kuru Swaha)",
                    "author": "मनु भण्डारी (Manu Bhandari)",
                    "publishYear": 1981,
                    "description": "शहरी जीवन की जटिलताओं को दर्शाता उपन्यास।नाम बेढब, शैली बेडौल, कथानक बेपैंदे का । कुल मिलाकर बेजोड़ बकवास । नायक-नायिका के चारों ओर है बम्बई का बुद्धिजीवी और अपराधजीवी जगत ।कई-कई कथानक होते हुए भी कोई कथानक नहीं है, भाषा और शिल्प के कई-कई तेवर होते हुए भी कोई तेवर नहीं है, आधुनिकता और परम्परा की तमाम अनुगूँजें होते हुए भी कहीं कोई वादी-संवादी स्वर नहीं है । यह एक ऐसा उपन्यास है, जो स्वयं को नकारता ही चला जाता है ।.",
                    "category": ["Fiction", "Drama", "Social"],
                    "imageUrl": "https://m.media-amazon.com/images/I/81DkzdvBjJL._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 119.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "सूरज का सातवाँ घोड़ा (Suraj Ka Satvan Ghoda)",
                    "author": "धर्मवीर भारती (Dharamveer Bharti)",
                    "publishYear": 1952,
                    "description": "मानव जीवन के विभिन्न रंगों को दर्शाती कहानियों का संग्रह।'सूरज का सातवाँ घोड़ा' धर्मवीर भारती जी का एक प्रयोगात्मक और मौलिक उपन्यास है|सूरज का सातवाँ घोड़ा धर्मवीर भारती का प्रसिद्ध उपन्यास है। धर्मवीर भारती की इस लघु औपन्यासिक रचना में हितोपदेश और पंचतंत्रवाली शैली में ७ दोपहरी में कही गई कहानियों के रूप में एक उपन्यास निर्मित किया गया है। इसे लघु उपन्यास की संज्ञा दी गयी है। कथानक की बुनावट उपन्यास की विषय–वस्तु को नए आयाम प्रदान करती है। ‘सूरज का सातवॉं घोड़ा’ भी भारत-ईरान की प्राचीन  शैलियों से प्रभावित माना जाता है। लेकिन, पुरानी किस्सागोई का यह तरीका –अलिफलैला, पंचतंत्र, दशकुमारचरित अथवा कथासरित्सागर - ‘सूरज का सातवाँ घोड़ा’ की ऊपरी त्वचा मात्र है, इसे कथानक का बुनियादी ढाँचा नहीं माना जा सकता। एक दूसरी शैली भी इसमें परिलक्षित की जा सकती है- वह है, वीरगाथाओं या अन्य महाकाव्यों जैसी शैली, जिसमें रचनाकार अपनी रचनाओं का रचयिता ही नहीं वरन् घटनाओं के बीच स्वयं भी उपस्थित है। वह भोक्ता और रचयिता दोनों है। इस प्रकार रचना तटस्थ होने, निजी अनुभूति को सार्वजनिक अनुभव में तब्दील करने का दायित्व बन जाती है। ‘पृथ्वीराज रासो’ के रचयिता चंदवरदायी इसके महत्त्वपूर्ण्  चरित्र भी हैं, ठीक उसी तरह जैसे वाल्मीकि और तुलसी खुद को अपनी रचनाओं में उपस्थित कर देते हैं या कि संजय महाभारत के घटनाचक्र में मौजूद है।",
                    "category": ["Fiction", "Philosophical", "Drama"],
                    "imageUrl": "https://m.media-amazon.com/images/I/A1DAbvETwYL._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 129.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "नीलकंठ (Neelkanth)",
                    "author": "महादेवी वर्मा (Mahadevi Verma)",
                    "publishYear": 1936,
                    "description": "महादेवी वर्मा द्वारा लिखित आत्मकथात्मक रचनाओं का संग्रह।प्रयाग जैसे शान्त और सांस्कृतिक आश्रम-नगर में नखास कोना एक विचित्र स्थिति रखता है. जितने दंगे-फसाद ओर छुरे चाकुबाजी की घटनाएं घटित होती हैं, सबका अशुभारम्भ प्रायः नखासकोने से ही होता है.उसकी कुछ और भी अनोखी विशेषताएं हैं. घास काटने की मशीन के बड़े-चौड़े चाकू से लेकर फरसा, कुल्हाड़ी, आरी, छुरी आदि में धार रखने वालों तक की दुकानें वहीं हैं. अतः गोंठिल चाकू-छुरी को पैना करने के लिए दूर जाने की आवश्यकता नहीं है. आंखों का सरकारी अस्पताल भी वहीं प्रतिष्ठित है. शत्रु-मित्र की पहचान के लिए दृष्टि कमज़ोर हो तो वहां ठीक कराई जा सकती है, जिससे कोई भूल होने की सम्भावना न रहे. इसके अतिरिक्त एक और अस्पताल उसी कोने में गरिमापूर्ण ऐतिहासिक स्थिति रखता है. आहत, मुमूर्ष व्यक्ति की दृष्टि से यह विशेष सुविधा है. यदि अस्पताल के अन्तःकणों में स्थान न मिले, यदि डॉक्टर, नर्स आदि का दर्शन दुर्लभ रहे तो बरामदे-पोर्टिको आदि में विश्राम प्राप्त हो सकता है और यदि वहां भी स्थानाभाव हो, तो अस्पताल के कम्पाउण्ड में मरने का संतोष तो मिल ही सकता है.",
                    "category": ["Non-Fiction", "Autobiography", "Classic"],
                    "imageUrl": "https://m.media-amazon.com/images/I/71yMdKrcAvL._AC_UY327_FMwebp_QL65_.jpg",
                    "price": 159.99,
                    "language": "Hindi",
                    "binding": "Paperback",
                    "tags": ["Crazy Bookpacks", "Academic", "24 hr deals"],
                    "discount": 5,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "Exam Prep",
                    "author": "Govind Puri",
                    "publishYear": 1985,
                    "description": "This book on Objective Quantitative Aptitude will play a vital role in your Competitive Exams preparations as Quantitative Aptitude is a fundamental part of almost all Competitive Examinations in India, including Banking, SSC, Railways, UPSC, and various other State Level Exams.",
                    "category": ["Exam"],
                    "imageUrl": "https://m.media-amazon.com/images/G/31/img20/Books/092021/UnrecExam/Quantitative_aptitude__Reasoning._SY530_QL85_.jpg",
                    "price": 159.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": [ "Academic"],
                    "discount": 5,
                    "rating":3,
                    "stock":300
                },
                {
                    "title": "The Diary of a Young Girl",
                    "author": "Anne Frank",
                    "publishYear": 1947,
                    "description": "The diary of Anne Frank, a Jewish girl hiding from the Nazis in Amsterdam during World War II.Discovered in the attic in which she spent the last years of her life, Anne Frank's remarkable diary has become a world classic—a powerful reminder of the horrors of war and an eloquent testament to the human spirit.In 1942, with the Nazis occupying Holland, a thirteen-year-old Jewish girl and her family fled their home in Amsterdam and went into hiding. For the next two years, until their whereabouts were betrayed to the Gestapo, the Franks and another family lived cloistered in the “Secret Annexe” of an old office building. Cut off from the outside world, they faced hunger, boredom, the constant cruelties of living in confined quarters, and the ever-present threat of discovery and death. In her diary Anne Frank recorded vivid impressions of her experiences during this period. By turns thoughtful, moving, and surprisingly humorous, her account offers a fascinating commentary on human courage and frailty and a compelling self-portrait of a sensitive and spirited young woman whose promise was tragically cut short.",
                    "category": ["Non-Fiction", "Autobiography", "Historical"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1560816565i/48855.jpg",
                    "price": 129.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "stock":300
                },
                {
                    "title": "Long Walk to Freedom",
                    "author": "Nelson Mandela",
                    "publishYear": 1994,
                    "description": "The autobiography of Nelson Mandela, detailing his early life, education, and 27 years in prison.Nelson Mandela is one of the great moral and political leaders of our time: an international hero whose lifelong dedication to the fight against racial oppression in South Africa won him the Nobel Peace Prize and the presidency of his country.Since his triumphant release in 1990 from more than a quarter-century of imprisonment, Mandela has been at the center of the most compelling and inspiring political drama in the world. As president of the African National Congress and head of South Africa's anti-apartheid movement, he was instrumental in moving the nation toward multiracial government and majority rule. He is revered everywhere as a vital force in the fight for human rights and racial equality.The foster son of a Thembu chief, Mandela was raised in the traditional, tribal culture of his ancestors, but at an early age learned the modern, inescapable reality of what came to be called apartheid, one of the most powerful and effective systems of oppression ever conceived. In classically elegant and engrossing prose, he tells of his early years as an impoverished student and law clerk in a Jewish firm in Johannesburg, of his slow political awakening, and of his pivotal role in the rebirth of a stagnant ANC and the formation of its Youth League in the 1950s.He describes the struggle to reconcile his political activity with his devotion to his family, the anguished breakup of his first marriage, and the painful separations from his children. He brings vividly to life the escalating political warfare in the fifties between the ANC and the government, culminating in his dramatic escapades as an underground leader and the notorious Rivonia Trial of 1964, at which he was sentenced to life imprisonment. Herecounts the surprisingly eventful twenty-seven years in prison and the complex, delicate negotiations that led both to his freedom and to the beginning of the end of apartheid. Finally he provides the ultimate inside account.",
                    "category": ["Non-Fiction", "Autobiography", "Historical"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327997342i/318431.jpg",
                    "price": 159.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "The Story of My Experiments with Truth",
                    "author": "Mahatma Gandhi",
                    "publishYear": 1927,
                    "description": "The autobiography of Mahatma Gandhi, focusing on his spiritual and moral development.It is not my purpose to attempt a real autobiography. I simply want to tell the story of my numerous experiments with truth, and as my life consists of nothing but those experiments, it is true that the story will take the shape of an autobiography...Identification with everything that lives is impossible without self-purification; without self-purification, the observance of the law of Ahimsa must remain an empty dream; God can never be realised by one who is not pure of heart. Self-purification, therefore, must remain purification in all walks of life. And purification being highly infectious, purification of oneself necessarily leads to the purification of one's surroundings.But the path to self-purification is hard and steep. To attain perfect purity, one has to become absolutely passion-free in thought, speech and action; to rise above the opposing currents of love and hatred, attachment and repulsion. I know that I have not in me as yet the triple purity, in spite of constant ceaseless striving for it. That is why the world's praise fails to move me; indeed it very often stings me. To conquer the subtle passions seems to me far harder than the physical conquest of the world by the force of arms. Ever since my return to India, I have had experiences of the dormant passions lying hidden within me. The knowledge of them has made me feel humiliated though not defeated. The experiences and experiments have sustained me and given me great joy. But I know I still have before me a difficult path to traverse. I must reduce myself to zero. So long as a man does not of his own free will put himself last among his fellow creatures, there is no salvation for him. Ahimsa is the farthest limit of humility.",
                    "category": ["Non-Fiction", "Autobiography", "Philosophical"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1201265181i/2656458.jpg",
                    "price": 139.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "stock":300
                },
                {
                    "title": "I Know Why the Caged Bird Sings",
                    "author": "Maya Angelou",
                    "publishYear": 1969,
                    "description": "Maya Angelou's memoir about her early years and the struggles she faced growing up in the American South.Here is a book as joyous and painful, as mysterious and memorable, as childhood itself. I Know Why the Caged Bird Sings captures the longing of lonely children, the brute insult of bigotry, and the wonder of words that can make the world right. Maya Angelou's debut memoir is a modern American classic beloved worldwide.Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local “powhitetrash.” At eight years old and back at her mother's side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Years later, in San Francisco, Maya learns that love for herself, the kindness of others, her own strong spirit, and the ideas of great authors (“I met and fell in love with William Shakespeare”) will allow her to be free instead of imprisoned.",
                    "category": ["Non-Fiction", "Autobiography", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327957927i/13214.jpg",
                    "price": 149.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "Dreams from My Father",
                    "author": "Barack Obama",
                    "publishYear": 1995,
                    "description": "Barack Obama's memoir about his early life, his work as a community organizer, and his search for identity.In this lyrical, unsentimental, and compelling memoir, the son of a black African father and a white American mother searches for a workable meaning to his life as a black American. It begins in New York, where Barack Obama learns that his father—a figure he knows more as a myth than as a man—has been killed in a car accident. This sudden death inspires an emotional odyssey—first to a small town in Kansas, from which he retraces the migration of his mother's family to Hawaii, and then to Kenya, where he meets the African side of his family, confronts the bitter truth of his father's life, and at last reconciles his divided inheritance.",
                    "category": ["Non-Fiction", "Autobiography", "Political"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1352340675i/88061.jpg",
                    "price": 169.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "stock":300
                },
               
                {
                    "title": "Bossypants",
                    "author": "Tina Fey",
                    "publishYear": 2011,
                    "description": "Tina Fey's memoir about her journey from aspiring comedian to successful television star.Tina Fey was just a young girl with a dream: a recurring stress dream that she was being chased through a local airport by her middle-school gym teacher. She also had a dream that one day she would be a comedian on TV.At last, Tina Fey's story can be told. From her youthful days as a vicious nerd to her tour of duty on Saturday Night Live; from her passionately halfhearted pursuit of physical beauty to her life as a mother eating things off the floor; from her one-sided college romance to her nearly fatal honeymoon—from the beginning of this paragraph to this final sentence.",
                    "category": ["Non-Fiction", "Autobiography", "Comedy"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1481509554i/9418327.jpg",
                    "price": 159.99,
                    "language": "English",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "The Glass Castle",
                    "author": "Jeannette Walls",
                    "publishYear": 2005,
                    "description": "Jeannette Walls' memoir about her unconventional and often dysfunctional childhood.The Glass Castle is a remarkable memoir of resilience and redemption, and a revelatory look into a family at once deeply dysfunctional and uniquely vibrant. When sober, Jeannette's brilliant and charismatic father captured his children's imagination, teaching them physics, geology, and how to embrace life fearlessly. But when he drank, he was dishonest and destructive. Her mother was a free spirit who abhorred the idea of domesticity and didn't want the responsibility of raising a family.",
                    "category": ["Non-Fiction", "Autobiography", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1523542886i/7445.jpg",
                    "price": 169.99,
                    "language": "Italian",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "stock":300
                },
                {
                    "title": "Born a Crime",
                    "author": "Trevor Noah",
                    "publishYear": 2016,
                    "description": "Trevor Noah's memoir about growing up in apartheid South Africa and his rise to fame as a comedian.Trevor Noah's unlikely path from apartheid South Africa to the desk of The Daily Show began with a criminal act: his birth. Trevor was born to a white Swiss father and a black Xhosa mother at a time when such a union was punishable by five years in prison. Living proof of his parents' indiscretion, Trevor was kept mostly indoors for the earliest years of his life, bound by the extreme and often absurd measures his mother took to hide him from a government that could, at any moment, steal him away. Finally liberated by the end of South Africa's tyrannical white rule, Trevor and his mother set forth on a grand adventure, living openly and freely and embracing the opportunities won by a centuries-long struggle.",
                    "category": ["Non-Fiction", "Autobiography", "Comedy"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1473867911i/29780253.jpg",
                    "price": 214.99,
                    "language": "Russian",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "When Breath Becomes Air",
                    "author": "Paul Kalanithi",
                    "publishYear": 2016,
                    "description": "Paul Kalanithi's memoir about his life and battle with terminal cancer as a neurosurgeon.For readers of Atul Gawande, Andrew Solomon, and Anne Lamott, a profoundly moving, exquisitely observed memoir by a young neurosurgeon faced with a terminal cancer diagnosis who attempts to answer the question 'What makes a life worth living?'",
                    "category": ["Non-Fiction", "Autobiography", "Inspirational"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1492677644i/25899336.jpg",
                    "price": 179.99,
                    "language": "Italian",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "Steve Jobs",
                    "author": "Walter Isaacson",
                    "publishYear": 2011,
                    "description": "The authorized biography of Steve Jobs, based on numerous interviews with him, his family, and colleagues.Walter Isaacson's worldwide bestselling biography of Apple cofounder Steve Jobs. Based on more than forty interviews with Steve Jobs conducted over two years--as well as interviews with more than 100 family members, friends, adversaries, competitors, and colleagues--Walter Isaacson has written a riveting story of the roller-coaster life and searingly intense personality of a creative entrepreneur whose passion for perfection and ferocious drive revolutionized six industries: personal computers, animated movies, music, phones, tablet computing, and digital publishing. Isaacson's portrait touched millions of readers. At a time when America is seeking ways to sustain its innovative edge, Jobs stands as the ultimate icon of inventiveness and applied imagination. He knew that the best way to create value in the twenty-first century was to connect creativity with technology. He built a company where leaps of the imagination were combined with remarkable feats of engineering. Although Jobs cooperated with the author, he asked for no control over what was written. He put nothing off-limits. He encouraged the people he knew to speak honestly. He himself spoke candidly about the people he worked with and competed against. His friends, foes, and colleagues offer an unvarnished view of the passions, perfectionism, obsessions, artistry, devilry, and compulsion for control that shaped his approach to business and the innovative products that resulted. His tale is instructive and cautionary, filled with lessons about innovation, character, leadership, and values. Steve Jobs is the inspiration for the movie of the same name starring Michael Fassbender, Kate Winslet, Seth Rogen, and Jeff Daniels, directed by Danny Boyle with a screenplay by Aaron Sorkin.",
                    "category": ["Non-Fiction", "Autobiography", "Business"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1511288482i/11084145.jpg",
                    "price": 199.99,
                    "language": "German",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "stock":300
                },
                {
                    "title": "The Autobiography of Malcolm X",
                    "author": "Malcolm X and Alex Haley",
                    "publishYear": 1965,
                    "description": "The life story of Malcolm X, based on interviews with journalist Alex Haley.Through a life of passion and struggle, Malcolm X became one of the most influential figures of the 20th Century. In this riveting account, he tells of his journey from a prison cell to Mecca, describing his transition from hoodlum to Muslim minister. Here, the man who called himself 'the angriest Black man in America' relates how his conversion to true Islam helped him confront his rage and recognize the brotherhood of all mankind.",
                    "category": ["Non-Fiction", "Autobiography", "Historical"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1434682864i/92057.jpg",
                    "price": 160.99,
                    "language": "Spanish",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "stock":300
                },
                {
                    "title": "The Liars' Club",
                    "author": "Mary Karr",
                    "publishYear": 1995,
                    "description": "Mary Karr's memoir about her troubled childhood in a small Texas town.Mary Karr grew up in a swampy East Texas refinery town in a volatile and defiantly loving family. In this funny, devastating, haunting memoir and with a raw and often painful honesty, she looks back at life with a painter mother, seven times married, whose outlaw spirit could tip over into psychosis, and a hard-drinking, fist-swinging father who liked nothing better than to spin tales with his cronies at the Liars' Club.",
                    "category": ["Non-Fiction", "Autobiography", "Drama"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1499665766i/14241.jpg",
                    "price": 139.99,
                    "language": "Chinese",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "Wild",
                    "author": "Cheryl Strayed",
                    "publishYear": 2012,
                    "description": "Cheryl Strayed's memoir about her 1,100-mile solo hike along the Pacific Crest Trail.At twenty-two, Cheryl Strayed thought she had lost everything. In the wake of her mother's death, her family scattered and her own marriage was soon destroyed. Four years later, with nothing more to lose, she made the most impulsive decision of her life. With no experience or training, driven only by blind will, she would hike more than a thousand miles of the Pacific Crest Trail from the Mojave Desert through California and Oregon to Washington State — and she would do it alone.",
                    "category": ["Non-Fiction", "Autobiography", "Adventure"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1453189881i/12262741.jpg",
                    "price": 149.99,
                    "language": "French",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "Just as I Am",
                    "author": "Cicely Tyson",
                    "publishYear": 2021,
                    "description": "Cicely Tyson's memoir about her legendary career in Hollywood and her personal life.Just as I Am is my truth. It is me, plain and unvarnished, with the glitter and garland set aside. Here, I am indeed Cicely, the actress who has been blessed to grace the stage and screen for six decades. Yet I am also the church girl who once rarely spoke a word. I am the teenager who sought solace in the verses of the old hymn for which this book is named. I am a daughter and mother, a sister, and a friend. I am an observer of human nature and the dreamer of audacious dreams. I am a woman who has hurt as immeasurably as I have loved, a child of God divinely guided by His hand. And here in my ninth decade, I am a woman who, at long last, has something meaningful to say.",
                    "category": ["Non-Fiction", "Autobiography", "Inspirational"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1608626888i/50622390.jpg",
                    "price": 189.99,
                    "language": "Russian",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "International Best Sellers"],
                    "discount": 10,
                    "stock":300
                },
                {
                    "title": "A Promised Land",
                    "author": "Barack Obama",
                    "publishYear": 2020,
                    "description": "Barack Obama's memoir about his early political career and first term as President of the United States.In the stirring, highly anticipated first volume of his presidential memoirs, Barack Obama tells the story of his improbable odyssey from young man searching for his identity to leader of the free world, describing in strikingly personal detail both his political education and the landmark moments of the first term of his historic presidency—a time of dramatic transformation and turmoil.",
                    "category": ["Non-Fiction", "Autobiography", "Political"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1600357110i/55361205.jpg",
                    "price": 200.99,
                    "language": "Chinese",
                    "binding": "Hardcover",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 15,
                    "stock":300
                },
                {
                    "title": "Yes Please",
                    "author": "Amy Poehler",
                    "publishYear": 2014,
                    "description": "Amy Poehler's memoir about her journey through comedy and her personal life.In Amy Poehler's highly anticipated first book, Yes Please, she offers up a big juicy stew of personal stories, funny bits on sex and love and friendship and parenthood and real life advice (some useful, some not so much), like when to be funny and when to be serious. Powered by Amy's charming and hilarious, biting yet wise voice, Yes Please is a book full of words to live by.",
                    "category": ["Non-Fiction", "Autobiography", "Comedy"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1402815435i/20910157.jpg",
                    "price": 139.99,
                    "language": "Italian",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "Me Talk Pretty One Day",
                    "author": "David Sedaris",
                    "publishYear": 2000,
                    "description": "David Sedaris' memoir about his life in America and France, filled with humorous essays.Anyone that has read NAKED and BARREL FEVER, or heard David Sedaris speaking live or on the radio will tell you that a new collection from him is cause for jubilation. His recent move to Paris from New York inspired these hilarious new pieces, including 'Me Talk Pretty One Day', about his attempts to learn French from a sadistic teacher who declares that 'every day spent with you is like having a caesarean section'. His family is another inspiration. 'You Can't Kill the Rooster' is a portrait of his brother, who talks incessant hip-hop slang to his bewildered father. And no one hones a finer fury in response to such modern annoyances as restaurant meals presented in ludicrous towers of food and cashiers with six-inch fingernails.",
                    "category": ["Non-Fiction", "Autobiography", "Comedy"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1431013639i/4137.jpg",
                    "price": 149.99,
                    "language": "Spanish",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 5,
                    "stock":300
                },
                {
                    "title": "On Writing: A Memoir of the Craft",
                    "author": "Stephen King",
                    "publishYear": 2000,
                    "description": "Stephen King's memoir about his life and career as a writer, including writing advice.'Long live the King' hailed Entertainment Weekly upon the publication of Stephen King's On Writing. Part memoir, part master class by one of the bestselling authors of all time, this superb volume is a revealing and practical view of the writer's craft, comprising the basic tools of the trade every writer must have. King's advice is grounded in his vivid memories from childhood through his emergence as a writer, from his struggling early career to his widely reported near-fatal accident in 1999 -- and how the inextricable link between writing and living spurred his recovery. Brilliantly structured, friendly and inspiring, On Writing will empower and entertain everyone who reads it -- fans, writers, and anyone who loves a great story well told.(back cover)",
                    "category": ["Non-Fiction", "Autobiography", "Writing"],
                    "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1436735207i/10569.jpg",
                    "price": 169.99,
                    "language": "German",
                    "binding": "Paperback",
                    "tags": ["Best Seller", "Trending"],
                    "discount": 10,
                    "stock":300
                }
                
            ]
            
        
        
    
    
